# St7SetFaceLabelStyle

Sets the display style for face labels.

long St7SetFaceLabelStyle(long uID, long LabelStyle)
Input Parameters
uID
Strand7 model file ID.
LabelStyle
One of lsNone, lsEntityNumber, lsIDNumber or lsPropertyNumber.
Dependencies
Font
Assigned using St7SetEntityFont.